backend/app/controllers/api/v1/goals_controller.rb

    def index
        goals = Goal.all
---
SELECT "goals".* FROM "goals"

    def create
        goal = Goal.create(goal_params)
---
INSERT INTO "goals" ("title", "completed", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ":^)"], ["completed", 0], ["user_id", 1], ["created_at", "2021-02-23 03:50:02.633202"], ["updated_at", "2021-02-23 03:50:02.633202"]]

    def update
        #binding.pry
        goal = Goal.find(params[:id]).update(goal_params)
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "goals" SET "completed" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["completed", 1], ["updated_at", "2021-02-24 03:55:44.317417"], ["id", 14]]

    def destroy
        #binding.pry
        goal = Goal.find(params[:id]).destroy
---
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 66]]
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 66], ["LIMIT", 1]]