backend/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Jake"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Nea"], ["created_at", "2021-02-18 03:56:07.831724"], ["updated_at", "2021-02-18 03:56:07.831724"]]
---
    def create
       # binding.pry
        user = User.find_by(name: params[:users][:name])
        if user == nil
            user = User.create(user_params)